# FLSByClass

## Description
Function FLSByClass returns whether the global attributes are set to use the line style of the default class.

```pascal
FUNCTION FLSByClass : BOOLEAN;
```

```python

def vs.FLSByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the line style of the default class.<BR>
[sd 8/19/98]

## Examples
```pascal
useClassLStyle:=FLSByClass;
```

## Version
Availability: from VectorWorks8.0
## Category
* Document Attributes